nqngo22/CC3200_IFTTT_BMA222/main.c
      return lRetVal;
    }

    UART_PRINT("Device is configured in default state \n\r");

    CLR_STATUS_BIT_ALL(g_ulStatus);

    ///
    // Assumption is that the device is configured in station mode already
    // and it is in its default state
    //
    lRetVal = sl_Start(0, 0, 0);
    if (lRetVal < 0 || ROLE_STA != lRetVal)
    {
        UART_PRINT("Failed to start the device \n\r");
        return lRetVal;
    }

    UART_PRINT("Device started as STATION \n\r");

    //
    //Connecting to WLAN AP
    //
    lRetVal = WlanConnect();
    if(lRetVal < 0)
    {
        UART_PRINT("Failed to establish connection w/ an AP \n\r");
        GPIO_IF_LedOn(MCU_RED_LED_GPIO);
        return lRetVal;
    }

    UART_PRINT("Connection established w/ AP and IP is aquired \n\r");
    return 0;
}


char* itoa(signed char num)
{
	//converts an signed number to string
	//this function is used to convert the acelleration data to a string that I can insert to the POST message
	char* buffer = malloc(10);
	sprintf(buffer, "%d", num);
    return buffer;
}

//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! \return None
//!
//*****************************************************************************
void main()
{
    long lRetVal = -1;
    //
    // Initialize board configuration
    //
    BoardInit();

    PinMuxConfig();

    InitTerm();
    //Connect the CC3200 to the local access point
    lRetVal = connectToAccessPoint();
    //Set time so that encryption can be used
    lRetVal = set_time();
    if(lRetVal < 0)
    {
        UART_PRINT("Unable to set time in the device");
        LOOP_FOREVER();
    }
    //Connect to the website with TLS encryption
    lRetVal = tls_connect();
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
    }

    I2C_IF_Open(I2C_MASTER_MODE_FST);
    unsigned char ucDevAddr = 0x18;
    unsigned char ucRegOffsetX = 0x3;
    unsigned char ucRegOffsetY = 0x5;
    unsigned char aucRdDataBufX[256];
    unsigned char aucRdDataBufY[256];
    while(1){
    	//while loop that polls for sw2 and sw3 presses
    	if(GPIOPinRead(GPIOA2_BASE, 0x40)){
    		//sw2 pressed
			I2C_IF_Write(ucDevAddr,&ucRegOffsetX,1,0);
			//reads X acceleration data
			I2C_IF_Read(ucDevAddr, &aucRdDataBufX[0], 1);
			UART_PRINT("Xoffset: %d\r\n", (signed char) aucRdDataBufX[0]);
			//converts the char to signed int and then to a string
			char* sval = itoa((signed int)aucRdDataBufX[0]);
			UART_PRINT("sval: %s\r\n", sval);
			//sends the accelration to http_post() which will send the POST message over the internet
			http_post(lRetVal, sval,0);
    	}
    	if(GPIOPinRead(GPIOA1_BASE, 0x20)){
    			//sw3_pressed
				I2C_IF_Write(ucDevAddr,&ucRegOffsetY,1,0);
    			//reads Y acceleration data
				I2C_IF_Read(ucDevAddr, &aucRdDataBufY[0], 1);
				UART_PRINT("Yoffset: %d\r\n", (signed char) aucRdDataBufY[0]);
				//converts the char to signed int and then to a string
				char* sval = itoa((signed int)aucRdDataBufY[0]);
				UART_PRINT("sval: %s\r\n", sval);
				//sends the accelration to http_post() which will send the POST message over the internet
				http_post(lRetVal, sval,1);
			}
    }

    sl_Stop(SL_STOP_TIMEOUT);
    LOOP_FOREVER();
}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

static int http_post(int iTLSSockID, char* data, int y){
    char acSendBuff[512];
    char acRecvbuff[1460];
    char cCLLength[200];
    char* pcBufHeaders;
    int lRetVal = 0;

	pcBufHeaders = acSendBuff;
	if(y == 0){
		strcpy(pcBufHeaders, POSTHEADER);
		pcBufHeaders += strlen(POSTHEADER);
	}else{
		strcpy(pcBufHeaders, POSTHEADER3);
		pcBufHeaders += strlen(POSTHEADER3);
	}
	strcpy(pcBufHeaders, " HTTP/1.1\r\n");
	pcBufHeaders += strlen(" HTTP/1.1\r\n");
	strcpy(pcBufHeaders, HOSTHEADER);
	pcBufHeaders += strlen(HOSTHEADER);
	strcpy(pcBufHeaders, CHEADER);
	pcBufHeaders += strlen(CHEADER);
	strcpy(pcBufHeaders, "\r\n\r\n");

	int dataLength = strlen(DATA1L);
	dataLength += strlen(data);
	dataLength += strlen(DATA1R);

	strcpy(pcBufHeaders, CTHEADER);
	pcBufHeaders += strlen(CTHEADER);
	strcpy(pcBufHeaders, CLHEADER1);

	pcBufHeaders += strlen(CLHEADER1);
	sprintf(cCLLength, "%d", dataLength);

	strcpy(pcBufHeaders, cCLLength);
	pcBufHeaders += strlen(cCLLength);
	strcpy(pcBufHeaders, CLHEADER2);
	pcBufHeaders += strlen(CLHEADER2);

	strcpy(pcBufHeaders, DATA1L);
	pcBufHeaders += strlen(DATA1L);

	strcpy(pcBufHeaders, data);
	pcBufHeaders += strlen(data);

	strcpy(pcBufHeaders, DATA1R);
	pcBufHeaders += strlen(DATA1R);
	int testDataLength = strlen(pcBufHeaders);

	//
	// Send the packet to the server */
	//
	lRetVal = sl_Send(iTLSSockID, acSendBuff, strlen(acSendBuff), 0);
	if(lRetVal < 0)
	{
		UART_PRINT("POST failed. Error Number: %i\n\r",lRetVal);
    	sl_Close(iTLSSockID);
    	GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    	return lRetVal;
	}
	lRetVal = sl_Recv(iTLSSockID, &acRecvbuff[0], sizeof(acRecvbuff), 0);
	if(lRetVal < 0)
	{
		UART_PRINT("Received failed. Error Number: %i\n\r",lRetVal);
	    //sl_Close(iSSLSockID);
	    GPIO_IF_LedOn(MCU_RED_LED_GPIO);
	       return lRetVal;
	}
	else
	{
		acRecvbuff[lRetVal+1] = '\0';
		UART_PRINT(acRecvbuff);
		UART_PRINT("\n\r\n\r");
	}

	return 0;
}
